{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 229, 261, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block1_conv1", "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null}}, {"name": "block1_conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block1_conv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block1_conv1_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"name": "block1_conv1_act", "activation": "relu", "trainable": true}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block1_conv2", "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null}}, {"name": "block1_conv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block1_conv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block1_conv2_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"name": "block1_conv2_act", "activation": "relu", "trainable": true}}, {"name": "block2_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block2_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block2_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block2_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block2_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block2_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block2_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block2_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block2_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block2_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1, 1], "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "block2_pool", "pool_size": [3, 3], "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "block3_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "block3_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block3_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block3_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block3_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block3_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block3_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block3_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block3_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block3_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block3_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block3_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1, 1], "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "block3_pool", "pool_size": [3, 3], "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "block4_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "block4_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block4_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block4_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block4_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block4_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block4_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block4_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block4_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block4_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block4_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block4_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "conv2d_3", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1, 1], "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "block4_pool", "pool_size": [3, 3], "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "block5_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "block5_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block5_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block5_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block5_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block5_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block5_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block5_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block5_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block5_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block5_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block5_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block5_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block5_sepconv3", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block5_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block5_sepconv3_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "block6_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "block6_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block6_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block6_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block6_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block6_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block6_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block6_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block6_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block6_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block6_sepconv3", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block6_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block6_sepconv3_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "block7_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "block7_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block7_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block7_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block7_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block7_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block7_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block7_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block7_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block7_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block7_sepconv3", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block7_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block7_sepconv3_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "block8_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "block8_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block8_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block8_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block8_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block8_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block8_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block8_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block8_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block8_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block8_sepconv3", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block8_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block8_sepconv3_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "block9_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "block9_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block9_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block9_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block9_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block9_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block9_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block9_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block9_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block9_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block9_sepconv3", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block9_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block9_sepconv3_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "block10_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "block10_sepconv1_act", "activation": "relu", "trainable": true}}, {"name": "block10_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block10_sepconv1", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block10_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block10_sepconv1_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block10_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block10_sepconv2_act", "activation": "relu", "trainable": true}}, {"name": "block10_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block10_sepconv2", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "depth_multiplier": 1, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1]}}, {"name": "block10_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]], "config": {"scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "name": "block10_sepconv2_bn", "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"name": "block10_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block10_sepconv3_act", "activation": "relu", "trainable": true}}, {"name": "block10_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv3_act", 0, 0, {}]]], "config": {"depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "block10_sepconv3", "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 728, "activity_regularizer": null, "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "pointwise_constraint": null, "depthwise_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": 